Vamos aprender a criar une nova coluna em um DataFrame mas primeiro vamos criar um dicíonario com pandas para amazenar as notas dos alunos 'Maria','Jose', 'Witoria', depois armazena-lo em um DataFrame e por fim addicionar uma nova coluna que será chamada **Letras** onde todos os alunos tiraram a nota **O**. Primeiro temos que importar a biblioteca pandas para criar o nosso dataframe. Lembrando que cada chave será uma coluna do DataFrame.

In [ ]:
import pandas as pd

In [ ]:
# Criando um dicionário onde cada chave será uma coluna do DataFrame
dicionario = {
'Alunos':    ['Maria', 'Jose', 'Witoria'],
'Historia':  [8, 9 ,10],
'Geografia': [10, 9, 7]
}

In [ ]:
#Criando o DataFrame
df = pd.DataFrame(dicionario, columns=['Alunos','Historia','Geografia'])

In [ ]:
# visualizando o DataFrame
df

    Alunos  Historia  Geografia
0    Maria         8         10
1     Jose         9          9
2  Witoria        10          7

In [ ]:
# addicionando uma nova coluna
df['Nova Coluna'] = 0

In [ ]:
# visualizando o novo nada DataFrame
df

    Alunos  Historia  Geografia  Nova Coluna
0    Maria         8         10            0
1     Jose         9          9            0
2  Witoria        10          7            0

Pronto acabamos de addicionar a coluna **'Nova Coluna'**